---
kind: method
id: M:Autodesk.Revit.DB.Structure.BoundaryConditions.GetOrientTo
source: html/8e93c29c-cd8f-fb6f-3979-2e86ffebd575.htm
---
# Autodesk.Revit.DB.Structure.BoundaryConditions.GetOrientTo Method

Returns the boundary conditions orientation option.

## Syntax (C#)
```csharp
public BoundaryConditionsOrientTo GetOrientTo()
```

## Returns
The orientation option.